; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v6 ?v13)
             (pred_1 ?v10 ?v12)
             (pred_4 ?v6 ?v12)
             (pred_10 ?v7 ?v6 )
	     (pred_11 ?v6)
             (pred_6 ?v3)
             (pred_5 ?v10)
             (pred_12 ?v12)
             (pred_7 ?v6)
             (pred_8 ?v10)
             (pred_3 ?v6)
             (pred_2 ))



(:action op_4
:parameters (?v5 ?v11 ?v8 ?v1)
:precondition (and (pred_6 ?v5) (pred_6 ?v11) (pred_5 ?v8) (pred_12 ?v1)
          (pred_9 ?v5 ?v11) (pred_1 ?v8 ?v1)
                   (pred_4 ?v11 ?v1) (pred_11 ?v5) 
                   (pred_7 ?v11) (pred_8 ?v8))
:effect (and  (pred_3 ?v11) (not (pred_7 ?v11))))


(:action op_2
:parameters (?v5 ?v4)
:precondition (and (pred_6 ?v5) (pred_6 ?v4)
               (pred_11 ?v5) (pred_9 ?v5 ?v4) (pred_3 ?v4))
:effect (and (pred_11 ?v4) (not (pred_11 ?v5))))

(:action op_3
:parameters (?v5 ?v8)
:precondition (and (pred_6 ?v5) (pred_5 ?v8) 
                  (pred_11 ?v5) (pred_10 ?v8 ?v5) (pred_2 ))
:effect (and (pred_8 ?v8)
   (not (pred_10 ?v8 ?v5)) (not (pred_2 ))))


(:action op_1
:parameters (?v5 ?v2 ?v9)
:precondition (and (pred_6 ?v5) (pred_5 ?v2) (pred_5 ?v9)
                  (pred_11 ?v5) (pred_8 ?v9) (pred_10 ?v2 ?v5))
:effect (and (pred_8 ?v2) (pred_10 ?v9 ?v5)
        (not (pred_8 ?v9)) (not (pred_10 ?v2 ?v5))))

(:action op_5
:parameters (?v5 ?v8)
:precondition (and (pred_6 ?v5) (pred_5 ?v8) 
                  (pred_11 ?v5) (pred_8 ?v8))
:effect (and (pred_2 ) (pred_10 ?v8 ?v5) (not (pred_8 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_11 obj_21 obj_07 obj_08 obj_10 obj_17 obj_13 obj_15 obj_04 obj_20 obj_14 obj_02 obj_18 obj_03 obj_12
    obj_06 obj_01
    obj_16 obj_19 obj_05
    )

    (:init
       (pred_2)

       (pred_6 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_21)
       (pred_6 obj_07)
       (pred_6 obj_08)
       (pred_6 obj_10)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_14)
       (pred_6 obj_02)
       (pred_6 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_12 obj_06)
       (pred_12 obj_01)
       (pred_5 obj_16)
       (pred_5 obj_19)
       (pred_5 obj_05)

       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_21 obj_17)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_10 obj_11)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_13)
       (pred_9 obj_17 obj_21)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_17)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_10)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_12 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_4  obj_10 obj_06)
       (pred_4  obj_18 obj_01)
       (pred_4  obj_13 obj_01)
       (pred_3 obj_09)
       (pred_3 obj_11)
       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_3 obj_08)
       (pred_3 obj_17)
       (pred_3 obj_15)
       (pred_3 obj_04)
       (pred_3 obj_20)
       (pred_3 obj_14)
       (pred_3 obj_02)
       (pred_3 obj_03)
       (pred_3 obj_12)

       (pred_1  obj_16 obj_06)
       (pred_1  obj_19 obj_01)
       (pred_1  obj_05 obj_01)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_05 obj_14)
       (pred_11 obj_15)
    )

    (:goal (and
       (pred_10 obj_05 obj_03)
    ))
(:constraints
  (always (not (pred_11 obj_04)))
)
)

; plan
1. (op_2 obj_15 obj_08)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_08)
   goals met: 0 of 1
2. (op_2 obj_08 obj_09)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_09)
   goals met: 0 of 1
3. (op_2 obj_09 obj_11)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_11)
   goals met: 0 of 1
4. (op_2 obj_11 obj_21)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_21)
   goals met: 0 of 1
5. (op_2 obj_21 obj_17)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_17)
   goals met: 0 of 1
6. (op_2 obj_17 obj_20)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_20)
   goals met: 0 of 1
7. (op_2 obj_20 obj_14)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_14)
   goals met: 0 of 1
8. (op_3 obj_14 obj_05)
   deleted: (pred_10 obj_05 obj_14) (pred_2)
   added: (pred_8 obj_05)
   goals met: 0 of 1
9. (op_2 obj_14 obj_20)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_20)
   goals met: 0 of 1
10. (op_2 obj_20 obj_03)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_03)
   goals met: 0 of 1
11. (op_5 obj_03 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_2) (pred_10 obj_05 obj_03)
   goals met: 1 of 1
